---
title: Polyloop
classe: Autodesk.Revit.DB.Analysis.Polyloop
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# Polyloop

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ Centroid { get; }` | `polyloop.Centroid` | XYZ |
| `XYZ Direction { get; }` | `polyloop.Direction` | XYZ |
| `Boolean IsValidObject { get; }` | `polyloop.IsValidObject` | Boolean |
| `Double ComputeArea()` | `polyloop.ComputeArea()` | Double |
| `Void Dispose()` | `polyloop.Dispose()` | Void |
| `IList<XYZ> GetPoints()` | `polyloop.GetPoints()` | IList<XYZ> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```